#+TITLE: Artificial Intelligence
#+AUTHOR: Christos Dimitrakakis
#+EMAIL:christos.dimitrakakis@unine.ch
#+LaTeX_HEADER: \include{preamble}
#+LaTeX_CLASS_OPTIONS: [smaller]
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+TAGS: activity advanced definition exercise homework project example theory code
#+OPTIONS:   H:3
** Uninformed search
|---------------------------+----|
| Graph definitions         | 10 |
| Tree example              |  5 |
| Shortcut example          |  5 |
| Depth-first search        | 10 |
| The shortest path problem | 10 |
| Goals and DFS             | 10 |
| Shortest-path DFS         | 10 |
| Breadth-first search      | 10 |
| Iterative deepening       | 10 |
| Uniform cost search       | 10 |
|---------------------------+----|
|                           | 95 |
#+TBLFM: @11$2=vsum(@1..@10)

** Constraints
|-------------------------+-----|
| Local search            |  20 |
|-------------------------+-----|
| Constraint Satisfaction |  20 |
| Graph Colouring         |  20 |
| Meeting Scheduling      |  20 |
|-------------------------+-----|
| onstraint Optimisation  |  20 |
| Travelling Salesman     |  20 |
| Maximum Flow            |  20 |
|-------------------------+-----|
| Logical constraints     |  20 |
| Towers of Hanoi         |  20 |
|-------------------------+-----|
|                         | 160 |
#+TBLFM: @9$2=vsum(@1..@8)

* Project plan
  :LOGBOOK:
  CLOCK: [2024-04-11 Do 11:36]--[2024-04-11 Do 11:36] =>  0:00
  :END:
1. Define a deterministic, fully observable Wumpus world
2. Find optimal policies for any instance of this world. 
3. Consider a randomised version of the Wumpus world, where
3.1. Your moves are not deterministic 
3.2. The monster moves in a way relative to your position

4. Advanced versions
Only one of then can be done in practice
4.1. Partially-observable wumpus (where the positions are unknown) (logic-based)
4.2. Same, but with randomised observations. (probability-based)
4.3. Adversarial Wumpus (where the monster also solves its own optimisation problem)
